# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\Projects\EEforEveryone\2022\2201_MOTOR\sw\4_PSoC\2201_Motor\2201_Motor.cydsn\2201_Motor.cyprj
# Date: Mon, 21 Mar 2022 12:15:04 GMT
#set_units -time ns
create_clock -name {ADC_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_pwm(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_3}] [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {Clock_ENC(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_5}] [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {UART_SCBCLK(FFB)} -period 1625 -waveform {0 812.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {Clock_pwm} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {Clock_ENC} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 39 79} [list]


# Component constraints for E:\Projects\EEforEveryone\2022\2201_MOTOR\sw\4_PSoC\2201_Motor\2201_Motor.cydsn\TopDesign\TopDesign.cysch
# Project: E:\Projects\EEforEveryone\2022\2201_MOTOR\sw\4_PSoC\2201_Motor\2201_Motor.cydsn\2201_Motor.cyprj
# Date: Mon, 21 Mar 2022 12:15:03 GMT
